[
  {
    "id": 1,
    "author": "Michael Palin, Right!",
    "title": "Full Circle: a Pacific Journey",
    "description": "I stumbled upon Michael Palin’s talk held in my Erasmus host uni to promote his latest book, Diaries 1967-1979: The Python Years. IoE’s Logan Hall was packed.\n\nAt the event, Mr. Palin was as kind as he was funny and generous with the Python Years anecdotes, joking about how critics accused him of being conciliatory and \"relentlessly\" nice. One time Monty Python were doing the \"dead mother\" sketch and the audience reception (from mayors and other major VIPs) turned out to be \"the kind of silence you get when you’re trying to record sounds in outer space.\" He also talked about the difficulty of shooting that sequence of the Knights who say Ni! in Holy Grail: up a step ladder with a long, heavy, trailing cloak in freezing, body-numbing weather in Scotland, sapped of strength and a barely a squeak of a voice to yell Ni!; much to the annoyance of all the camera men perched on trees!\n\nLater, I had him sign a copy of Full Circle from his travel series, it was the cheaper option because I couldn't afford the hardback latest book which was around £20 but he was kind and didn't mind it when I asked him to sign a page off my notebook for my friend Earnest back in Metro Manila. He has this to say about the Philippines: “You don’t have to be long in the country to appreciate that the jeepney expresses the Filipino spirit: emotional, exuberant, celebratory; endearing and unwary. ",
    "image": "/img/Cov01_Palin.png",
    "signedImage": "/img/Signed01-Palin.jpg",
    "date": 2006
  },
  {
    "id": 2,
    "author": "Eddie Campbell",
    "title": "The Years Have Pants",
    "description": "2009 ComICA Festival, London. The session with Eddie Campbell at the Institute of Contemporary Arts began at 7 and I was running late. (A long story involving a broken printer, Tube closures, busted trains, Neanderthal passengers, a wailing baby, a tsunami of Piccadilly Circus tourists and a hundred meter dash up numerous flights of stairs. If I had half the brilliance of Mr. Campbell, I would show all this in a chuckle-inducing 9-panel spread, but I digress.) By the time I make it to the lecture room, witty banter’s in full swing as high caliber Glaswegian comic book artist gets grilled by high caliber Glaswegian comic. It couldn’t be more apt.\n\nSo there he was, Eddie Campbell, Alec MacGarry’ himself(!), in the flesh (plain undershirt, salt and pepper hair). Having the piss taken out of him by comedian Arnold Brown for name-dropping Quentin Tarantino’s mum who once commissioned the former to sketch her own Bacchus, god of wine. (Eddie: Connie, yeah, she gets around…Arnie: My God, how famous!) The main thread of the conversation here of course, would be the launch of Campbell’s mega-collection, Alec: The Years Have Pants. A hefty 640-pager that brings together his semi-autobiographical Alec books–The King Canute Crowd, Graffiti Kitchen, How to be an Artist, Little Italy, The Dead Muse, The Dance of Lifey Death, After the Snooter and some previously unpublished fragments plus a new book that bears the compilation’s title. Aldo had given me this wonderful omnibus as a birthday present and I was chuffed to lug it all the way to Central London to have it signed.\n\nIf I had to tell you some highlights of what my muddled brain picked up from this whole funny, inspiring event (aside from a prized autograph and sketch, of course) read the article I wrote for Rogue Magazine.",
    "image": "/img/Cov02_Campbell.jpg",
    "signedImage": "/img/Signed02-Campbell.jpg",
    "date": 2009
  },
  {
    "id": 3,
    "author": "Anne Carson",
    "title": "Nox",
    "description": "My poet friend V was the one who introduced me to Anne Carson via Plainwater and Eros the Bittersweet and I owe him for that. Then in 2010 Anne Carson was in town. So was he and off we went to the Royal Festival Hall to see her read from Nox. A codex, a scrapbook in a shoebox full of memory and loss (the poet's late brother) -- the book is a physical object yet for a few, her most heartfelt so far. I am still digesting most of it.",
    "image": "/img/Cov03_Carson.jpg",
    "signedImage": "/img/Signed03-Carson.jpg",
    "date": 2010
  },
  {
    "id": 4,
    "author": "Iain Sinclair",
    "title": "Ghost Milk",
    "description": "Notes from the Café OTO event.\n\nGhost Milk from gas lamps that lit the old East end.\n\n\"CGI smears on the blue fence. Real juice from a virtual host. Embalming fluid. A soup of photographic negatives. Soul food for the dead. The universal element in which we sink and swim\"\n\nGhost Milk also refers to the contamination on the Olympic site grounds which local councils didn't know about yet big construction corporations knew but kept on building these huge stadiums and shit.\n\nApparently there are missiles waiting to be pointed at potential 'terrorist threats' on top of Towerblocks overlooking the Olympic park and a security base in the middle of Epping Forest.\n\nOPEN founder and saxophonist Bill Parry-Davies reveals the contamination report for the Olympic Park. Sinclair's reading is supplemented by angry/sad sax riffs + projected footage of the Olympic site construction which kinda look like Afghanistan and Guatanamo. Anna Minton reads from her book 'Ground Control' republished with a new chapter on Olympic legacy. \"This is the architecture of extreme capitalism, which produces a divided landscape of privately owned, disconnected, high security, gated enclaves side by side with enclaves of poverty which remain untouched by the wealth around them.\"",
    "image": "/img/Cov04_Sinclair.jpg",
    "signedImage": "/img/Signed04-Sinclair.jpg",
    "date": 2012
  },
  {
    "id": 5,
    "author": "Alan Moore and guests",
    "title": "Dodgem Logic #1",
    "description": "Round Chapel, Hackney. Alan Moore with Stewart Lee, Steve Aylett, Robin Ince, Savage Pencil, Melinda Gebbie, Kevin O'Neill & The Retro Spankees.\n\nThe London Word Festival announcement said:\n\"Alan Moore’s reinvigoration of the underground fanzine, comes alive in the non-conformist surroundings of Hackney’s Round Chapel. A night of art, comedy, comment and put-something-back localism. Released bi-monthly since 2009, is equal parts escapist entertainment, social curiosity and grassroots activism: a formidable pick-and-mix of hardworking humour and indie-essaying. An ink-stained-mantle-carrier for all the socially involved photocopy-and-staple self-published antecedents. With stand-up from & , artists panel-up to talk about their comic work, while music comes from hyperactive racketeers With an exhibition of artwork from the magazine, and conducted by the editor-in-chief.  They’ll be stalls and more, so do get there as early as you can.\"\n\nSo I did. It was geekgasmic! To this day I still regret not having a copy of The Lost Girls that Melinda Gebbie would have signed. My notes say Mr Moore spoke of James Joyce moments in *Jerusalem* a la *Voice of the Fire*, and that I enjoyed the band and the self-deprecating humour.",
    "image": "/img/Cov05_Moore.jpg",
    "signedImage": "/img/Signed05-Moore.jpg",
    "date": 2011
  },
  {
    "id": 6,
    "author": "Octavia E. Butler",
    "title": "Parable of the Sower",
    "description": "When global climate change and economic crises lead to social chaos in the early 2020s, California becomes full of dangers, from pervasive water shortage to masses of vagabonds who will do anything to live to see another day. Fifteen-year-old Lauren Olamina lives inside a gated community with her preacher father, family, and neighbors, sheltered from the surrounding anarchy. In a society where any vulnerability is a risk, she suffers from hyperempathy, a debilitating sensitivity to others' emotions. Precocious and clear-eyed, Lauren must make her voice heard in order to protect her loved ones from the imminent disasters her small community stubbornly ignores.",
    "image": "https://imgur.com/nlJZP2a.png",
    "published": 1993
  },
  {
    "id": 7,
    "author": "Ta-Nehisi Coates",
    "title": "The Water Dancer",
    "description": "Young Hiram Walker was born into bondage. When his mother was sold away, Hiram was robbed of all memory of her—but was gifted with a mysterious power. Years later, when Hiram almost drowns in a river, that same power saves his life. This brush with death births an urgency in Hiram and a daring scheme: to escape from the only home he’s ever known.",
    "image": "https://imgur.com/R6K9qDh.png",
    "published": 2019
  },
  {
    "id": 8,
    "author": "Malcolm X and Alex Haley",
    "title": "The Autobiography of Malcolm X",
    "description": "In the searing pages of this classic autobiography, originally published in 1964, Malcolm X, the Muslim leader, firebrand, and anti-integrationist, tells the extraordinary story of his life and the growth of the Black Muslim movement. His fascinating perspective on the lies and limitations of the American Dream, and the inherent racism in a society that denies its nonwhite citizens the opportunity to dream, gives extraordinary insight into the most urgent issues of our own time.",
    "image": "https://imgur.com/FYOGKRR.png",
    "published": 1965
  },
  {
    "id": 9,
    "author": "Saeed Jones",
    "title": "How We Fight for Our Lives",
    "description": "Haunted and haunting, How We Fight for Our Lives is a stunning coming-of-age memoir about a young, black, gay man from the South as he fights to carve out a place for himself, within his family, within his country, within his own hopes, desires, and fears. Through a series of vignettes that chart a course across the American landscape, Jones draws readers into his boyhood and adolescence—into tumultuous relationships with his family, into passing flings with lovers, friends, and strangers.",
    "image": "https://imgur.com/LEpjND1.png",
    "published": 2019
  },
  {
    "id": 10,
    "author": "Glory Edim",
    "title": "Well-Read Black Girl: Finding Our Stories, Discovering Ourselves",
    "description": "Remember that moment when you first encountered a character who seemed to be written just for you? That feeling of belonging remains with readers the rest of their lives—but not everyone regularly sees themselves in the pages of a book. In this timely anthology, Glory Edim brings together original essays by some of our best black women writers to shine a light on how important it is that we all—regardless of gender, race, religion, or ability—have the opportunity to find ourselves in literature.",
    "image": "https://imgur.com/qpQ0Dat.png",
    "published": 2018
  },
  {
    "id": 11,
    "author": "Maya Angelou",
    "title": "I Know Why the Caged Bird Sings",
    "description": "Here is a book as joyous and painful, as mysterious and memorable, as childhood itself. I Know Why the Caged Bird Sings captures the longing of lonely children, the brute insult of bigotry, and the wonder of words that can make the world right. Maya Angelou’s debut memoir is a modern American classic beloved worldwide.",
    "image": "https://imgur.com/mGY5s6O.png",
    "published": 1969
  },
  {
    "id": 12,
    "author": "Helen Oyeyemi",
    "title": "Gingerbread",
    "description": "Influenced by the mysterious place gingerbread holds in classic children's stories, beloved novelist Helen Oyeyemi invites readers into a delightful tale of a surprising family legacy, in which the inheritance is a recipe.",
    "image": "https://i.imgur.com/EVnGJI4.png",
    "published": 2019
  },
  {
    "id": 13,
    "author": "Audre Lorde",
    "title": "Sister Outsider: Essays and Speeches",
    "description": "In this charged collection of fifteen essays and speeches, Lorde takes on sexism, racism, ageism, homophobia, and class, and propounds social difference as a vehicle for action and change. Her prose is incisive, unflinching, and lyrical, reflecting struggle but ultimately offering messages of hope.",
    "image": "https://imgur.com/A7KT0ip.png",
    "published": 1984
  },
  {
    "id": 14,
    "author": "Nnedi Okorafor",
    "title": "Who Fears Death",
    "description": "In a post-apocalyptic Africa, the world has changed in many ways; yet in one region genocide between tribes still bloodies the land. A woman who has survived the annihilation of her village and a terrible rape by an enemy general wanders into the desert, hoping to die. Instead, she gives birth to an angry baby girl with hair and skin the color of sand. Gripped by the certainty that her daughter is different—special—she names her Onyesonwu, which means \"Who fears death?\"  in an ancient language.",
    "image": "https://imgur.com/yGp1YG8.png",
    "published": 2010
  },
  {
    "id": 15,
    "author": "Ann Petry",
    "title": "The Street",
    "description": "The Street tells the poignant, often heartbreaking story of Lutie Johnson, a young black woman, and her spirited struggle to raise her son amid the violence, poverty, and racial dissonance of Harlem in the late 1940s. Originally published in 1946 and hailed by critics as a masterwork, The Street was Ann Petry's first novel, a beloved bestseller with more than a million copies in print. Its haunting tale still resonates today.",
    "image": "https://imgur.com/PHKEZMc.png",
    "published": 1946
  },
  {
    "id": 16,
    "author": "Octavia Butler",
    "title": "Kindred",
    "description": "Dana, a modern black woman, is celebrating her twenty-sixth birthday with her new husband when she is snatched abruptly from her home in California and transported to the antebellum South. Rufus, the white son of a plantation owner, is drowning, and Dana has been summoned to save him. Dana is drawn back repeatedly through time to the slave quarters, and each time the stay grows longer, more arduous, and more dangerous until it is uncertain whether or not Dana's life will end, long before it has a chance to begin.",
    "image": "https://imgur.com/07dGmCV.png",
    "published": 1979
  }
]
