[
  {
    "id": 1,
    "author": "Michael Palin, Right!",
    "title": "Full Circle: a Pacific Journey",
    "description": "A Doodle of Destiny. I stumbled upon Michael Palin’s talk held in my Erasmus host uni to promote his latest book, Diaries 1967-1979: The Python Years. IoE’s Logan Hall was packed.\n\nAt the event, Mr. Palin was as kind as he was funny and generous with the Python Years anecdotes, joking about how critics accused him of being conciliatory and \"relentlessly\" nice. One time Monty Python were doing the \"dead mother\" sketch and the audience reception (from mayors and other major VIPs) turned out to be \"the kind of silence you get when you’re trying to record sounds in outer space.\" He also talked about the difficulty of shooting that sequence of the Knights who say Ni! in Holy Grail: up a step ladder with a long, heavy, trailing cloak in freezing, body-numbing weather in Scotland, sapped of strength and a barely a squeak of a voice to yell Ni!; much to the annoyance of all the camera men perched on trees!\n\nLater, I had him sign a copy of Full Circle from his travel series, it was the cheaper option because I couldn't afford the hardback latest book which was around £20 but he was kind and didn't mind it when I asked him to sign a page off my notebook for my friend Earnest back in Metro Manila. He has this to say about the Philippines: “You don’t have to be long in the country to appreciate that the jeepney expresses the Filipino spirit: emotional, exuberant, celebratory; endearing and unwary. ",
    "image": "/img/Cov01_Palin.png",
    "signedImage": "/img/Signed01-Palin.jpg",
    "date": 2006
  },
  {
    "id": 2,
    "author": "Eddie Campbell",
    "title": "The Years Have Pants",
    "description": "2009 ComICA Festival, London. The session with Eddie Campbell at the Institute of Contemporary Arts began at 7 and I was running late. (A long story involving a broken printer, Tube closures, busted trains, Neanderthal passengers, a wailing baby, a tsunami of Piccadilly Circus tourists and a hundred meter dash up numerous flights of stairs. If I had half the brilliance of Mr. Campbell, I would show all this in a chuckle-inducing 9-panel spread, but I digress.) By the time I make it to the lecture room, witty banter’s in full swing as high caliber Glaswegian comic book artist gets grilled by high caliber Glaswegian comic. It couldn’t be more apt.\n\nSo there he was, Eddie Campbell, Alec MacGarry’ himself(!), in the flesh (plain undershirt, salt and pepper hair). Having the piss taken out of him by comedian Arnold Brown for name-dropping Quentin Tarantino’s mum who once commissioned the former to sketch her own Bacchus, god of wine. (Eddie: Connie, yeah, she gets around…Arnie: My God, how famous!) The main thread of the conversation here of course, would be the launch of Campbell’s mega-collection, Alec: The Years Have Pants. A hefty 640-pager that brings together his semi-autobiographical Alec books–The King Canute Crowd, Graffiti Kitchen, How to be an Artist, Little Italy, The Dead Muse, The Dance of Lifey Death, After the Snooter and some previously unpublished fragments plus a new book that bears the compilation’s title. Aldo had given me this wonderful omnibus as a birthday present and I was chuffed to lug it all the way to Central London to have it signed.\n\nIf I had to tell you some highlights of what my muddled brain picked up from this whole funny, inspiring event (aside from a prized autograph and sketch, of course) read the article I wrote for Rogue Magazine.",
    "image": "/img/Cov02_Campbell.jpg",
    "signedImage": "/img/Signed02-Campbell.jpg",
    "date": 2009
  },
  {
    "id": 3,
    "author": "Anne Carson",
    "title": "Nox",
    "description": "Fragments of a brother's life, folded in ink and silence—Carson's tactile elegy in a box. |  My poet friend Vince was the one who introduced me to Anne Carson via Plainwater and Eros the Bittersweet and I owe him for that. Then in 2010, Anne Carson was in town. So was he and off we went to the Royal Festival Hall to see her read from Nox. A codex, a scrapbook in a shoebox full of memory and loss (the poet's late brother) -- the book is a physical object yet for a few of us, her most heartfelt so far. I am still digesting most of it.",
    "image": "/img/Cov03_Carson.jpg",
    "signedImage": "/img/Signed03-Carson.jpg",
    "date": 2010
  },
  {
    "id": 4,
    "author": "Iain Sinclair",
    "title": "Ghost Milk",
    "description": "Notes from the Café OTO event.\n\nGhost Milk from gas lamps that lit the old East end.\n\n\"CGI smears on the blue fence. Real juice from a virtual host. Embalming fluid. A soup of photographic negatives. Soul food for the dead. The universal element in which we sink and swim\"\n\nGhost Milk also refers to the contamination on the Olympic site grounds which local councils didn't know about yet big construction corporations knew but kept on building these huge stadiums and shit.\n\nApparently there are missiles waiting to be pointed at potential 'terrorist threats' on top of Towerblocks overlooking the Olympic park and a security base in the middle of Epping Forest.\n\nOPEN founder and saxophonist Bill Parry-Davies reveals the contamination report for the Olympic Park. Sinclair's reading is supplemented by angry/sad sax riffs + projected footage of the Olympic site construction which kinda look like Afghanistan and Guatanamo. Anna Minton reads from her book 'Ground Control' republished with a new chapter on Olympic legacy. \"This is the architecture of extreme capitalism, which produces a divided landscape of privately owned, disconnected, high security, gated enclaves side by side with enclaves of poverty which remain untouched by the wealth around them.\"",
    "image": "/img/Cov04_Sinclair.jpg",
    "signedImage": "/img/Signed04-Sinclair.jpg",
    "date": 2012
  },
  {
    "id": 5,
    "author": "Alan Moore and guests",
    "title": "Dodgem Logic #1",
    "description": "Round Chapel, Hackney. Alan Moore with Stewart Lee, Steve Aylett, Robin Ince, Savage Pencil, Melinda Gebbie, Kevin O'Neill & The Retro Spankees.\n\nThe London Word Festival announcement said:\n\"Alan Moore’s reinvigoration of the underground fanzine, comes alive in the non-conformist surroundings of Hackney’s Round Chapel. A night of art, comedy, comment and put-something-back localism. Released bi-monthly since 2009, is equal parts escapist entertainment, social curiosity and grassroots activism: a formidable pick-and-mix of hardworking humour and indie-essaying. An ink-stained-mantle-carrier for all the socially involved photocopy-and-staple self-published antecedents. With stand-up from & , artists panel-up to talk about their comic work, while music comes from hyperactive racketeers With an exhibition of artwork from the magazine, and conducted by the editor-in-chief.  They’ll be stalls and more, so do get there as early as you can.\"\n\nSo I did. It was geekgasmic! To this day I still regret not having a copy of The Lost Girls that Melinda Gebbie would have signed. My notes say Mr Moore spoke of James Joyce moments in *Jerusalem* a la *Voice of the Fire*, and that I enjoyed the band and the self-deprecating humour.",
    "image": "/img/Cov05_Moore.jpg",
    "signedImage": "/img/Signed05-Moore.jpg",
    "date": 2011
  },
  {
    "id": 6,
    "author": "Douglas Coupland",
    "title": "Everywhere is Anywhere is Anything is Everything",
    "description": "This publication is the first monograph to provide a comprehensive overview of Douglas Coupland's visual art practice with significant critical assessments of his work. Existing publications on Coupland's artwork are limited in scope and focus on a select portion of his oeuvre. This book however, will be an enduring and extensive resource on Coupland's artistic practice, and is published in conjunction with a major exhibition of his work to be held at the Vancouver Art Gallery in 2014. Alongside his celebrated status as author of 13 best-selling novels, including his seminal debut Generation X: Tales for an Accelerated Culture, Coupland's output reflects the commitment of a true multidisciplinarian - he graduated in 1985 from the Emily Carr Institute of Art and Design, Vancouver before furthering his aesthetic studies at the Hokkaido College of Art and Design in Japan as well as the Sapporo Instituto Europeo di Design, Milan. After concentrating on his literary works for the entire 1990s, Coupland returned to his dormant artistic practice, exhibiting his work internationally in many solo and collective exhibitions. He has also diversified further, emboldening his body of work within non-fiction, film and television, as well as forays into fashion and design. Coming from a multi-disciplinary background, his work follows a diverse multi-media trajectory, focusing on an equally broad spread of personal themes from a fascination with the corruptive desirability of popular culture to the intrigue of military imagery..",
    "image": "/img/Cov06_Coupland.jpg",
    "signedImage": "/img/Signed06-Coupland.jpg",
    "date": 2012
  },
  {
    "id": 7,
    "author": "Gabriela Coleman",
    "title": "Hacker, Hoaxer, Whistleblower, Spy",
    "description": "Foyles event with Cory Doctorow, James Bridle, and Biella Coleman.  ************************************************************  Here is the ultimate book on the worldwide movement of hackers, pranksters, and activists that operates under the non-name Anonymous, by the writer the Huffington Post says 'knows all of Anonymous deepest, darkest secrets'. Half a dozen years ago, anthropologist Gabriella Coleman set out to study the rise of this global phenomenon just as some of its members were turning to political protest and dangerous disruption (before Anonymous shot to fame as a key player in the battles over WikiLeaks, the Arab Spring, and Occupy Wall Street). She ended up becoming so closely connected to Anonymous that the tricky story of her inside-outside status as Anon confidante, interpreter, and erstwhile mouthpiece forms one of the themes of this witty and entirely engrossing book. The narrative brims with details unearthed from within a notoriously mysterious subculture, whose semi-legendary tricksters such as Topiary, tflow, Anachaos, and Sabu emerge as complex, diverse, politically and culturally sophisticated people. Propelled by years of chats and encounters with a multitude of hackers, including imprisoned activist Jeremy Hammond and the double agent who helped put him away, Hector Monsegur, Hacker, Hoaxer, Whistleblower, Spy is filled with insights into the meaning of digital activism and little understood facets of culture in the Internet age, including the history of trolling, the ethics and metaphysics of hacking, and the origins and manifold meanings of 'the lulz'.",
    "image": "/img/Cov07_Coleman.jpg",
    "signedImage": "/img/Signed07-Coleman.jpg",
    "date": 2012
  },
  {
    "id": 8,
    "author": "In Real Life",
    "title": "Cory Doctorow",
    "description": "Anda loves Coarsegold Online. The massively-multiplayer role playing game is a place where she can be a leader, a fighter, and a hero. But things become a lot more complicated when Anda befriends a gold farmer - a poor Chinese kid whose job is to collect valuable objects and sell them to other players for real money. This behaviour is strictly against the rules in Coarsegold, but Anda soon comes to realize that questions of right and wrong are a lot less straightforward when a real person's real livelihood is at stake. From acclaimed teen author and digerati mogul Cory Doctorow and rising star cartoonist Jen Wang, In Real Life is a sensitive, thoughtful look at adolescence, gaming, poverty, and culture clash.",
    "image": "/img/Cov08_Doctorow.jpg",
    "signedImage": "/img/Signed08-Doctorow.jpg",
    "date": 2012
  },
  {
    "id": 9,
    "author": "William Gibson",
    "title": "The Peripheral",
    "description": "The Sacred Wiggle of the Chosen Sharpie. Royal Festival Hall. Be still, my cyberspaced-out mind. Mr Gibson happily signed a stack of books for me and my friends back home!   ************************************************************   --The sky above the port was the color of television, tuned to a dead channel.--Gibson discusses the opening in the foreword to the latest Penguin edition of Neuromancer. \"It took at least a decade for me to realize that many of my readers, even in 1984, could never have experienced Neuromancer's opening line as I'd intended them to. I'd actually composed that first image with the black-and-white video-static of my childhood in mind, sodium-silvery and almost painful—a whopping anachronism, right at the very start of my career in the imaginary future. But an invisible one, interestingly; one that reveals a peculiar grace enjoyed by all imaginary futures as they make their way up the timeline and into the real future, where we all must go. The reader never stopped to think that I might have been thinking, however unconsciously, of the texture and color of a signal-free channel on a wooden-cabinet Motorola with fabric-covered speakers. Readers compensated for me, shouldering an additional share of the imaginative burden, and allowed whatever they assumed was the color of static to take on the melancholy of the phrase dead channel.\" ",
    "image": "/img/Cov09_Gibson.jpg",
    "signedImage": "/img/Signed09-Gibson.jpg",
    "date": 2014
  },
  {
    "id": 10,
    "author": "Miranda July",
    "title": "It Chooses You",
    "description": "At the London Review of Books. Oh so Hollywood. Or not. The woman had an entourage member who banned picture taking. Which I wasn't too crazy about either. This one's for a friend, I said and she signed it.",
    "image": "/img/Cov010_July.jpg",
    "signedImage": "/img/Signed010-July.jpg",
    "date": 2015
  },
  {
    "id": 11,
    "author": "Michael Rosen",
    "title": "Who are refugees and migrants?  What makes people leave their homes and other big questions.",
    "description": "Royal Albert Hall. Came with my son and our friends to enjoy a fun reading of Mustard, Custard, Grumble Belly and Gravy, stayed for Michael Rosen's energy, brilliance, and kindness.  ************************************************************  What does it mean for people to have to leave their homes, and what happens when they seek entry to another country? This book explores the history of refugees and migration around the world and the effects on people of never-ending war and conflict. It compares the effects on society of diversity and interculturalism with historical attempts to create a racially 'pure' culture. It takes an international perspective, and offers a range of views from people who have personal experience of migration, including the campaigners Meltem Avcil and Muzoon Almellehan, the comedian and actor Omid Djalili and the poet Benjamin Zephaniah. Aimed at young people aged 10 and upwards, the book encourages readers to think for themselves about the issues involved. There is also a role-play activity asking readers to imagine themselves in the situation of having to decide whether to leave their homes and seek refuge in a new country. Part of the groundbreaking and important 'And Other Big Questions' series, which offers balanced and considered views on the big issues we face in the world we live in today.",
    "image": "/img/Cov011_Rosen.jpg",
    "signedImage": "/img/Rosen.jpg",
    "date": 2017
  },
  {
    "id": 12,
    "author": "David McCandless",
    "title": "Information is Beautiful",
    "description": "David McCandless (born 1971)is a British data-journalist, writer, and information designer. McCandless began his career writing for cult video game magazines such as Your Sinclair and PC Zone in the late 1980s and 1990s before moving on to work for The Guardian and Wired magazine. Since the publication of Information Is Beautiful in 2009, his information design work has appeared in numerous publications, including The Guardian, Wired, and Die Zeit, and has also been showcased at the Museum of Modern Art in New York,the Wellcome Trust gallery in London, and at the Tate Britain.",
    "image": "/img/Cov012_McCandless.jpg",
    "signedImage": "/img/Signed012-McCandless.jpg",
    "date": 2017
  },
  {
    "id": 13,
    "author": "Maria Alyokhina",
    "title": "Riot Days",
    "description": "In conversation with Masha & Olya of Pussy Riot @ the Union Chapel. Olya is the really young ex-cop and Masha the 'ex-con.' I liked that Masha was full of playful humour, full of hope; not cynical at all. When someone asked the usual 'who inspires you' question, she shared her personal canon of Russian poets and protest literature I should have taken notes. She said they're not leaving Russia because they don't want their country to be only represented by assholes.  ************************************************************ \"People who believe in freedom and democracy think it will exist forever. That is a mistake. What happened in Russia - what happened to me - could happen anywhere. When I was jailed for political protest, I learned that prison just doesn't teach you to follow the rules. It teaches you to think that you can never break them. It's inevitable that the prison gates will open at some point. But this doesn't mean that you leave the 'prisoner' category and go straight into the category of 'the free'. Freedom does not exist unless you fight for it everyday. \" ",
    "image": "/img/Cov013_Alyokhina.jpg",
    "signedImage": "/img/Signed013-Alyokhina.png",
    "date": 2018
  },
  {
    "id": 14,
    "author": "Laurie Anderson",
    "title": "All the Things I Lost in the Flood",
    "description": "Illegible Proof of Greatness.  ************************************************************   Laurie Anderson is one of the most revered artists working today, and she is as prolific as she is inventive. She is a musician, performance artist, composer, fiction writer, and filmmaker (her most recent foray, Heart of a Dog, was lauded as an experimental marvel by the Los Angeles Times). Anderson moves seamlessly between the music world and the fine-art world while maintaining her stronghold in both. A true polymath, her interest in new media made her an early pioneer of harnessing technology for artistic purposes long before the technology boom of the last ten years. Regardless of the medium, however, it is exploration of language (and how it seeps into the image) and storytelling that is her metier. A few years ago, Anderson began poring through her extensive archive of nearly forty years of work, which includes scores of documentation, notebooks, and sketchbooks. In the process, she rediscovered important work and looked at well-known projects with a new lens. In this landmark volume, the artist brings together the most comprehensive collection of her artwork to date, some of which has never before been seen or published. Spanning drawing, multimedia installations, performance, and new projects using augmented reality, the extensive volume traverses four decades of her ground-breaking art. Each chapter includes commentary written by Anderson herself, offering an intimate understanding of her work through the artist s own words.",
    "image": "/img/Cov014_Anderson.jpg",
    "signedImage": "/img/Signed014-Anderson.png",
    "date": 2018
  },
  {
    "id": 15,
    "author": "Penelope Bagieu",
    "title": "Brazen",
    "description": "I really enjoyed this event from Alliance Française and Institut Français in London.   ************************************************************  Pénélope Bagieu is a French illustrator and comic designer. In 2016, Bagieu created the blog BD Les Culottées for Le Monde, which was eventually compiled into book form and released in 2018. She created one comic a week for 30 weeks, originally in French. Each comic featured a woman with an unusual or inspiring story. The work was released in French in two volumes with the subtitle Des Femmes Qui ne Font Que ce Qu'elles Veulent (Women Who Do as They Please). In English it was released as one volume with the title Brazen: Rebel Ladies Who Rocked the World. The English version has only 29 stories instead of the original 30, as \"Phoolan Devi, the Indian Queen of Bandits\" was removed because it included the rape of a 10-year-old girl by her husband. Brazen has been translated into 11 languages, and each version is a little different due to local restrictions. On July 20, 2019, she received an Eisner Award for Best U.S. Edition of International Material at San Diego Comic-Con, for Brazen: Rebel Ladies Who Rocked the World. (WIKIPEDIA)",
    "image": "/img/Cov015_Bagieu.jpg",
    "signedImage": "/img/Signed015-Bagieu.jpg",
    "date": 2018
  },
  {
    "id": 16,
    "author": "Mary M. Talbot and Bryan Talbot",
    "title": "The Red Virgin and the Vision of Utopia",
    "description": "Set against the background of violence and state repression in a turbulent period of French history, The Red Virgin and the Vision of Utopia chronicles the incredible and outrageous life of Louise Michel, the revolutionary feminist dubbed ‘The Red Virgin of Montmartre’. A utopian dreamer, notorious anarchist, teacher, orator and poet, she was decades ahead of her time. Always a radical, she fought on the barricades defending the short-lived Paris Commune of 1871 against the reactionary regime that massacred thousands of French citizens after the Commune’s defeat. Deported to a penal colony on the other side of the Earth, she took up the cause of the indigenous population against French colonial oppression. Celebrating the utopian urge in nineteenth-century literature and politics and the origins of science fiction, The Red Virgin and the Vision of Utopia is the third collaboration of best-selling academic and graphic novelist Mary M. Talbot with her husband, the graphic novel pioneer Bryan Talbot. Their first book together, Dotter of her Father's Eyes, won the 2012 Costa Biography Award.",
    "image": "/img/Cov016_Talbots.jpg",
    "signedImage": "/img/Signed016-Talbots.jpg",
    "date": 2018
  },
  {
    "id": 17,
    "author": "Pat Cadigan",
    "title": "Tea From an Empty Cup",
    "description": "\"Go on, sweetie,\" the amazing Pat Cadigan, cyberpunk queen urged me on, \"They may pretend otherwise, but all writers love it when you ask for their autograph.\"  ************************************************************   On July 9th 2018 Team Human partnered with Virtual Futures for an evening of connection and conversation at JuJu's Bar and Stage in London. Joining Douglas on stage, science fiction, fantasy, and horror writer Pat Cadigan followed by biologist, author, and TED outlaw Rupert Sheldrake.  ************************************************************  \"I swear they told me I was terminal...but that was back in December 2014. What can I say? Heaven doesn’t want me and Hell’s afraid I’ll take over.\" Pat Cadigan won the Arthur C. Clarke Award twice for her novels *Synners* and *Fools*, and the Scribe Award three times for Best Novelisation, most recently for *Ultraman*. She has also won three Locus Awards: best short story for \"Angel,\" best collection",
    "image": "/img/Cov017_Cadigan.jpg",
    "signedImage": "/img/Signed017-Cadigan.jpg",
    "date": 2018
  },
  {
    "id": 18,
    "author": "Douglas Rushkoff",
    "title": "Throwing Rocks at the Google Bus",
    "description": " ************************************************************ Named one of the \"world's ten most influential intellectuals\" by MIT, Douglas Rushkoff is an author and documentarian who studies human autonomy in a digital age. His twenty books include the upcoming Survival of the Richest: Escape Fantasies of the Tech Billionaires, Team Human, based on his podcast, as well as the bestsellers Present Shock, Throwing Rocks at the Google Bus, Program or Be Programmed, Life Inc, and Media Virus. He also made the PBS Frontline documentaries Generation Like, The Persuaders, and Merchants of Cool. His book Coercion won the Marshall McLuhan Award, and the Neil Postman Award for Career Achievement in Public Intellectual Activity. He coined such concepts as viral media, screenagers, and social currency, and has been a leading voice for applying digital media toward social and economic justice. He a research fellow of the Institute for the Future, and Professor of Media Theory and Digital Economics at CUNY/Queens. ",
    "image": "/img/Cov018_Rushkoff.jpg",
    "signedImage": "/img/Signed018-Rushkoff.jpg",
    "date": 2018
  },
  {
    "id": 19,
    "author": "Sayaka Murata",
    "title": "Convenience Store Woman",
    "description": "Because planning is overrated: impromptu encounters with authors and their uncapped pens. Out of curiosity while in Foyles Soho, I listened to a reading by Akutagawa winner Sayaka Murata (& her translator Ginny Tapley Takemori). I enjoyed it and proceeded to get a signed copy. ************************************************************ Sayaka Murata was born in Inzai, Chiba Prefecture, Japan. In 2016 her 10th novel, Konbini ningen (Convenience Store Woman), won the prestigious Akutagawa Prize. Konbini ningen has sold over 1.5 million copies in Japan[9] and in 2018 it became her first book to be translated into English, under the title Convenience Store Woman. It has been translated into more than 30 languages...Conformity is often placed at the heart of Japanese culture, a notion that Murata frequently explores within her works. In this work, Keiko, the main heroine, finds herself trying to escape from reality's expectations of marrying and choosing a traditional career. Keiko eventually finds that her convenience store job is her only way to feel like a \"normal cog in society.\" [WIKIPEDIA]",
    "image": "/img/Cov019_Murata.jpg",
    "signedImage": "/img/Signed019-Murata.jpg",
    "date": 2018
  },
  {
    "id": 21,
    "author": "Jeanette Winterson",
    "title": "Frankisstein",
    "description": "Purcell Room, Southbank Centre. An amazing book reading like a one-woman radio adaptation of her own universe (with AI voices and a fog machine). Winterson is such an eloquent speaker as well and makes me want to actually read Mary Shelley. ************************************************************ Set across three centuries and multiple narratives, Frankissstein is an audacious exploration of identity, technology and sexuality which considers what will happen when homo sapiens are no longer the smartest beings on the planet and suggests we are much closer to that future than we realise",
    "image": "/img/Cov021_Winterson.jpg",
    "signedImage": "/img/Signed021-Winterson.jpg",
    "date": 2018
  },
  {
    "id": 22,
    "author": "Charlie Jane Anders",
    "title": "The City in the Middle of the Night",
    "description": "Charlie Jane Anders is the author of Lessons in Magic and Disaster (Aug 2025), about a young witch who teaches her heartbroken mother how to do magic. Previously, she published the Unstoppable trilogy, which began with Victories Greater Than Death. The trilogy has been optioned by Michael B. Jordan's Outlier Society and Amazon Prime Video, and all three books won the Locus Award and were shortlisted for the Lodestar Award. Her writing advice book Never Say You Can't Survive: How to Get Through Hard Times by Making Up Stories won the Hugo Award for Best Related Work. She also recently published a short story collection called Even Greater Mistakes. Her previous novels for adults include All the Birds in the Sky (2016) and The City in the Middle of the Night (2019). Her work has won the Hugo, Nebula, Lambda Literary, Crawford, Sturgeon and Locus Awards. Her TED Talk, \"Go Ahead, Dream About the Future\" has been viewed nearly four million times. With Annalee Newitz, Charlie Jane co-hosts a podcast about the meaning of science fiction called Our Opinions Are Correct. Charlie Jane hugs trees, and keeps a British penny in her left shoe at all times.",
    "image": "/img/Cov022_Anders.png",
    "signedImage": "/img/Signed022-Anders.jpg",
    "date": 2019
  },
  {
    "id": 23,
    "author": "Annalee Newitz",
    "title": "Autonomous",
    "description": "Annalee Newitz writes fiction and nonfiction about the intersection of science, technology and culture. Their first novel, Autonomous, won the Lambda Literary Award and was nominated for the Nebula and Locus Awards. Their book Scatter, Adapt, and Remember was nominated for the LA Times Book Award. They are currently a contributing opinion writer at the New York Times. Previously, they were the founding editor of io9, and served as the editor-in-chief of Gizmodo and as the tech culture editor at Ars Technica. They have also written for publications including Wired, Popular Science, the New Yorker, the Atlantic, Slate, Washington Post, Smithsonian Magazine, and more. They have published short stories in Lightspeed, Shimmer, Apex, and Technology Review's Twelve Tomorrows. Annalee is the co-host of the Hugo Award-winning podcast, Our Opinions Are Correct. They were the recipient of a Knight Science Journalism Fellowship at MIT, worked as a policy analyst at the Electronic Frontier Foundation, and has a Ph.D. in English and American Studies from UC Berkeley. Learn more at AnnaleeNewitz.com",
    "image": "/img/Cov023_Newitz.jpg",
    "signedImage": "/img/Signed023-Newitz.jpg",
    "date": 2019
  },
  {
    "id": 24,
    "author": "Charlie Jane Anders & Annalee Newitz",
    "title": "She's Such a Geek",
    "description": "She's Such a Geek is a ground-breaking anthology that celebrates women who have flourished in the male-dominated realms of technical and cultural arcana. Editors Annalee Newitz and Charlie Anders bring together a diverse range of critical and personal essays about the meaning of female nerdhood by women who are in love with genomics, obsessed with blogging, learned about sex from Dungeons and Dragons, and aren't afraid to match wits with men or computers. More than anything, She's Such a Geek is a celebration and call to arms: it's a hopeful book which looks forward to a day when women will invent molecular motors, design the next ultra-tiny supercomputer, and run the government.",
    "image": "/img/Cov024_AndersNewitz.jpg",
    "signedImage": "/img/Signed024-AndersNewitz.jpg",
    "date": 2019
  },
  {
    "id": 26,
    "author": "Brett Anderson",
    "title": "Afternoons with the Blinds Drawn",
    "description": "Sadly, I was nowhere near Brett Anderson's Byronic gravitational field when I procured this artefact. Honestly, I wouldn't have minded queueing. Because I still love Suede. Interesting what David Bowie once said about them: \"Still one of the great British bands of the '90s....They have the enviable knack of taking the rather pathetic fumble of a quick fuck under the pier and extracting those few golden moments that many years later convince oneself that, for one brief flickering moment, one was as inspired as Romeo or, in some cases, Juliet. The poor things are bound to be an institution by the year 2000. Dame Brett, anybody? \"",
    "image": "/img/Cov026_Anderson.jpg",
    "signedImage": "/img/Signed026-Anderson.jpg",
    "date": 2019
  },
  {
    "id": 25,
    "author": "Ellen Lupton",
    "title": "Extra Bold",
    "description": "At the Beatrice Warde Memorial Lecture at St Bride's. Ellen Lupton is THE North Star of typography and after a ho-hum week with the greyest London skies, her insightful and brilliant presentation —sprinkled with useful nuggets of professional wisdom from her persona, Type Mom— was exactly what I needed. I listened to her contextualisation of Beatrice Ward’s Crystal Goblet vis-à-vis Ancient Rome‘s (toxic) masculine vibe of militaristic capital letters. Ellen Lupton walked us through some of history’s typographers-turned-writers: Walt Whitman and his sperm fonts, Honore de Balzac, abolitionist novelist William Wells Brown and Joachim Maria Machado de Assis whose novel The Posthumous Memoirs of Brás Cubas had entire chapters made of just punctuation marks. A lot of things she imparted were new to me: Gretel Adorno’s unsung work for the Frankfurt School, the nuances of power behind the typographical terms ‘orphans and widows’ and the Swedish designers trying to change the way those lone words hang. In person, just as in her design education videos, Lupton is the cool, humorous professor who inspires, enriches, and at just the right moment, unleashes the funniest, cleverest takes. Her teaching style is consistent with her ice cream theory of graphic design: it is evident in the generous scoops of knowledge and research that she serves up (which are so pleasant to digest), topped with an incisive, critical lens (rich, memorable, intense), a healthy sprinkling of humour (delightful details) with the cherry on top (the unique element) that is kindness and her sincerity in wanting the learner to succeed. I know this sounds gushy, but what a treat it was indeed to have learned a lot, laughed a bit, and have copies of her books signed. Thank you, Type Legend!",
    "image": "/img/Cov025_Lupton.jpg",
    "signedImage": "/img/Signed025-Lupton.jpg",
    "date": 2023
  }
]
